; domain
(define (domain grow-fairy-moss)
  (:requirements :strips :typing)
  (:types plant container water)

  (:predicates
    ;; Plant predicates
    (for-sale ?p - plant)
    (purchased ?p - plant)
    (position-plant ?p - plant ?pos)
    (size ?p - plant ?sz)
    (shape ?p - plant ?sh)

    ;; Container predicates
    (loc ?c - container ?location)
    (volume ?c - container ?vol)

    ;; Water predicates
    (comp ?w - water ?comp)
    (wetness ?w - water ?wts)
    (position-water ?w - water ?pos)
  )

  ;; Action:
  (:action ask-for-moss
    :parameters (?p - plant)
    :precondition (for-sale ?p)
    :effect (purchased ?p)
  )

  ;; Action:
  (:action find-container
    :parameters (?c - container)
    :precondition (loc ?c in-cabinet)
    :effect (loc ?c on-countertop)
  )

  ;; Action:
  (:action fill-bowl
    :parameters (?w - water ?c - container)
    :precondition (and
                    (loc ?c on-countertop)
                    (wetness ?w dry)
                    (volume ?c empty))
    :effect (and
              (comp ?w filled)
              (wetness ?w wet)
              (position-water ?w inside-bowl)
              (volume ?c filled))
  )

  ;; Action:
  (:action add-fairy-moss
    :parameters (?p - plant ?w - water)
    :precondition (and
                    (purchased ?p)
                    (position-plant ?p outside-of-bowl)
                    (comp ?w filled))
    :effect (and
              (position-plant ?p inside-bowl)
              (comp ?w now-mixed))
  )

  ;; Action:
  (:action place-suitable-position
    :parameters (?c - container ?w - water)
    :precondition (and
                    (loc ?c on-countertop)
                    (position-water ?w inside-bowl))
    :effect (and
              (loc ?c on-table)
              (position-water ?w in-suitable-position))
  )

  ;; Action:
  (:action prune
    :parameters (?p - plant)
    :precondition (and
                    (size ?p larger)
                    (shape ?p mess))
    :effect (and
              (size ?p smaller)
              (shape ?p pruned))
  )
)

; problem
(define (problem grow-fairy-moss-problem)
  (:domain grow-fairy-moss)
  
  (:objects
    fairy-moss - plant
    bowl-container - container
    water-1 - water
  )

  (:init
    ;;
    (for-sale fairy-moss)
    (position-plant fairy-moss outside-of-bowl)
    (size fairy-moss larger)
    (shape fairy-moss mess)

    (loc bowl-container in-cabinet)
    (volume bowl-container empty)

    (comp water-1 just-water)
    (wetness water-1 dry)
    (position-water water-1 outside-bowl)
  )

  (:goal
    (and
      (purchased fairy-moss)
      (position-plant fairy-moss inside-bowl)
      (size fairy-moss smaller)
      (shape fairy-moss pruned)

      (loc bowl-container on-table)

      (comp water-1 now-mixed)
      (position-water water-1 in-suitable-position)
    )
  )
)

; plan
1. (find-container bowl-container)
   added: (loc bowl-container on-countertop)
   goals met: 0 of 7
2. (ask-for-moss fairy-moss)
   added: (purchased fairy-moss)
   goals met: 1 of 7
3. (fill-bowl water-1 bowl-container)
   added: (comp water-1 filled) (wetness water-1 wet) (position-water water-1 inside-bowl) (volume bowl-container filled)
   goals met: 1 of 7
4. (prune fairy-moss)
   added: (size fairy-moss smaller) (shape fairy-moss pruned)
   goals met: 3 of 7
5. (add-fairy-moss fairy-moss water-1)
   added: (position-plant fairy-moss inside-bowl) (comp water-1 now-mixed)
   goals met: 5 of 7
6. (place-suitable-position bowl-container water-1)
   added: (loc bowl-container on-table) (position-water water-1 in-suitable-position)
   goals met: 7 of 7
